app/views/key_results/_form.html.erb

SELECT "key_results".* FROM "key_results" WHERE "key_results"."objective_id" = ?  [["objective_id", 6]]
SELECT "objectives".* FROM "objectives"
---
    <%= f.label :objective_id %>
    <%= collection_select(:key_result, :objective_id, Objective.all, :id, :description, {prompt: true}, {class: "form-control"}) %>