app/controllers/objectives_controller.rb

  def index
    @objectives = Objective.all
---
SELECT "objectives".* FROM "objectives"

  def show
    @key_results = KeyResult.where(objective_id: @objective.id).all
    @weeks = get_quarter_weeks(@objective.year, @objective.quarter)
    @progresses = Hash.new

    @key_results.each do |key_result|
      @progresses[key_result.id] = Hash.new

      @kr_progresses = WeeklyProgress.where(key_result_id: key_result.id).all
      @kr_progresses.each do |kr_progress|
---
SELECT "key_results".* FROM "key_results" WHERE "key_results"."objective_id" = ?  [["objective_id", 6]]
SELECT  "key_results".* FROM "key_results" WHERE "key_results"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "weekly_progresses".* FROM "weekly_progresses" WHERE "weekly_progresses"."key_result_id" = ?  [["key_result_id", 2]]
SELECT  "weekly_progresses".* FROM "weekly_progresses" WHERE "weekly_progresses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @objective = Objective.new(objective_params)

    respond_to do |format|
      if @objective.save
---
INSERT INTO "objectives" ("description", "organization_id", "created_at", "updated_at", "year", "quarter") VALUES (?, ?, ?, ?, ?, ?)  [["description", "Sharpen the Axe & Start 10x"], ["organization_id", 1], ["created_at", 2017-01-19 16:48:56 UTC], ["updated_at", 2017-01-19 16:48:56 UTC], ["year", 2017], ["quarter", 1]]

  def update
    respond_to do |format|
      if @objective.update(objective_params)
---
UPDATE "objectives" SET "year" = ?, "quarter" = ?, "updated_at" = ? WHERE "objectives"."id" = ?  [["year", 2017], ["quarter", 1], ["updated_at", 2017-01-17 00:36:27 UTC], ["id", 2]]

  def destroy
    @objective.destroy
---
DELETE FROM "objectives" WHERE "objectives"."id" = ?  [["id", 1]]

    def set_objective
      @objective = Objective.find(params[:id])
---
SELECT  "objectives".* FROM "objectives" WHERE "objectives"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]