app/views/weekly_progresses/_form.html.erb

SELECT "key_results".* FROM "key_results"
SELECT "weekly_progresses".* FROM "weekly_progresses" WHERE "weekly_progresses"."key_result_id" = ?  [["key_result_id", 2]]
---
    <%= f.label :key_result %>
    <%= collection_select(:weekly_progress, :key_result_id, KeyResult.all, :id, :description, {prompt: true}, {class: "form-control"}) %>